Revit 2027 API
RoomTag.IsInRoom Property
Identifies if the tag is located in a room.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInRoom { get; }
Public ReadOnly Property IsInRoom As Boolean
	Get
public:
property bool IsInRoom {
	bool get ();
}
member IsInRoom : bool with get
Property Value
Boolean
Remarks
In some cases the tag may not be located in a room so it looses temporairly an association with the room.
See Also
Reference
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace